modulolabs/modulo-lib/ModuloHardware/boards.txt
# This is for Arduino 1.0. The boards.txt file for Arduino 1.5 is in the avr subdir

modulo.name=Modulo Controller
modulo.upload.protocol=avr109
modulo.upload.maximum_size=28672
modulo.upload.speed=57600
modulo.upload.disable_flushing=true
modulo.bootloader.low_fuses=0xff
modulo.bootloader.high_fuses=0xd8
modulo.bootloader.extended_fuses=0xcb
modulo.bootloader.path=caterina
modulo.bootloader.file=Caterina-Modulo.hex
modulo.bootloader.unlock_bits=0x3F
modulo.bootloader.lock_bits=0x2F
modulo.build.mcu=atmega32u4
modulo.build.f_cpu=16000000L
modulo.build.vid=0x16D0
modulo.build.pid=0x0A67
modulo.build.core=arduino:arduino
modulo.build.variant=modulo
